app/controllers/exercises_controller.rb

  def index
    exercises = Exercise.all
---
SELECT "exercises".* FROM "exercises"

  def show
    exercises = Exercise.find_by(id: params[:id])
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

def destroy
  exercises = Exercise.find_by(id: params[:id])
  if exercises
    exercises.destroy
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "exercises" WHERE "exercises"."id" = ?  [["id", 3]]