app/controllers/registrations_controller.rb

    def create
      user = User.new(registration_params)

      if user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at", "email", "password_digest") VALUES (?, ?, ?, ?, ?)  [["username", "denis1"], ["created_at", "2023-07-08 18:38:22.560349"], ["updated_at", "2023-07-08 18:38:22.560349"], ["email", "were@gmail.com"], ["password_digest", "[FILTERED]"]]