app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password_digest" = ? LIMIT ?  [["email", "glen449@gmail.com"], ["password_digest", "[FILTERED]"], ["LIMIT", 1]]
---
    def create
      user = User.find_by(email: params[:email], password_digest: params[:password_digest])