app/controllers/workouts_controller.rb

    def index
      workouts = Workout.all
---
SELECT "workouts".* FROM "workouts"

    def update
      workout = Workout.find_by(id: params[:id])
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def destroy
      workout = Workout.find_by(id: params[:id])
---
SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]